[Killed] Regex
mx-common-validations/src/curp/validators.ts:4:27
 export namespace CurpValidators {
 
-  const regexOnlyNumber = /^([0-9])$/;
+  const regexOnlyNumber = /^([^0-9])$/;
   const regexOnlyLetter = /^([A-Z])$/i;
 
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Survived] Regex
mx-common-validations/src/curp/validators.ts:4:27
 export namespace CurpValidators {
 
-  const regexOnlyNumber = /^([0-9])$/;
+  const regexOnlyNumber = /([0-9])$/;
   const regexOnlyLetter = /^([A-Z])$/i;
 

[Killed] BlockStatement
mx-common-validations/src/curp/validators.ts:7:48
   const regexOnlyNumber = /^([0-9])$/;
   const regexOnlyLetter = /^([A-Z])$/i;
 
-  export function validateFormat(curp: string) {
-    const fullDate = getCurpFullDate(curp);
-    if (fullDate) {
-      return isValidDate(fullDate);
-    }
-    return false;
-  }
+  export function validateFormat(curp: string) {}
 
   export function validateFormatAndAge(curp: string, minAge: number, maxAge: number) {
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  undefined

Difference:

[Killed] BlockStatement
mx-common-validations/src/curp/validators.ts:9:19
 
   export function validateFormat(curp: string) {
     const fullDate = getCurpFullDate(curp);
-    if (fullDate) {
-      return isValidDate(fullDate);
-    }
+    if (fullDate) {}
     return false;
   }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] ConditionalExpression
mx-common-validations/src/curp/validators.ts:9:9
 
   export function validateFormat(curp: string) {
     const fullDate = getCurpFullDate(curp);
-    if (fullDate) {
+    if (true) {
       return isValidDate(fullDate);
     }
killedBy: CurpValidators #validateFormat should return false for an invalid curp format
statusReason: TypeError: Cannot read properties of null (reading 'substring')

[Killed] BlockStatement
mx-common-validations/src/curp/validators.ts:15:86
     return false;
   }
 
-  export function validateFormatAndAge(curp: string, minAge: number, maxAge: number) {
-    const fullDate = getCurpFullDate(curp);
-    if (fullDate && isValidDate(fullDate)) {
-      return isValidAge(fullDate, minAge, maxAge);
-    }
-    return false;
-  }
+  export function validateFormatAndAge(curp: string, minAge: number, maxAge: number) {}
 
   function getCurpFullDate(curp: string) {
killedBy: CurpValidators #validateFormatAndAge should return true for a curp with a valid format and age between 18 and 30
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  undefined

Difference:

[Killed] BlockStatement
mx-common-validations/src/curp/validators.ts:17:44
 
   export function validateFormatAndAge(curp: string, minAge: number, maxAge: number) {
     const fullDate = getCurpFullDate(curp);
-    if (fullDate && isValidDate(fullDate)) {
-      return isValidAge(fullDate, minAge, maxAge);
-    }
+    if (fullDate && isValidDate(fullDate)) {}
     return false;
   }
killedBy: CurpValidators #validateFormatAndAge should return true for a curp with a valid format and age between 18 and 30
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] LogicalOperator
mx-common-validations/src/curp/validators.ts:17:9
 
   export function validateFormatAndAge(curp: string, minAge: number, maxAge: number) {
     const fullDate = getCurpFullDate(curp);
-    if (fullDate && isValidDate(fullDate)) {
+    if (fullDate || isValidDate(fullDate)) {
       return isValidAge(fullDate, minAge, maxAge);
     }
killedBy: CurpValidators #validateFormatAndAge should return false for a curp with an invalid format
statusReason: TypeError: Cannot read properties of null (reading 'substring')

[Killed] BlockStatement
mx-common-validations/src/curp/validators.ts:23:42
     return false;
   }
 
-  function getCurpFullDate(curp: string) {
-    const groups = regexFormat.exec(curp);
-    if (!groups) {
-      return null;
-    }
-
-    const date = groups[2];
-    const centuryCode = groups[6];
-    if (!date || !centuryCode) {
-      return null;
-    }
-
-    if (regexOnlyNumber.test(centuryCode)) {
-      return `19${date}`;
-    } else if (regexOnlyLetter.test(centuryCode)) {
-      return `20${date}`;
-    }
-    return null;
-  }
+  function getCurpFullDate(curp: string) {}
 
   function isValidDate(date: string) {
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] BooleanLiteral
mx-common-validations/src/curp/validators.ts:25:9
 
   function getCurpFullDate(curp: string) {
     const groups = regexFormat.exec(curp);
-    if (!groups) {
+    if (groups) {
       return null;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] ConditionalExpression
mx-common-validations/src/curp/validators.ts:25:9
 
   function getCurpFullDate(curp: string) {
     const groups = regexFormat.exec(curp);
-    if (!groups) {
+    if (false) {
       return null;
     }
killedBy: CurpValidators #validateFormat should return false for an invalid curp format
statusReason: TypeError: Cannot read properties of null (reading '2')

[Killed] BooleanLiteral
mx-common-validations/src/curp/validators.ts:31:18
 
     const date = groups[2];
     const centuryCode = groups[6];
-    if (!date || !centuryCode) {
+    if (!date || centuryCode) {
       return null;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] BooleanLiteral
mx-common-validations/src/curp/validators.ts:31:9
 
     const date = groups[2];
     const centuryCode = groups[6];
-    if (!date || !centuryCode) {
+    if (date || !centuryCode) {
       return null;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] ConditionalExpression
mx-common-validations/src/curp/validators.ts:35:9
       return null;
     }
 
-    if (regexOnlyNumber.test(centuryCode)) {
+    if (false) {
       return `19${date}`;
     } else if (regexOnlyLetter.test(centuryCode)) {
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] BlockStatement
mx-common-validations/src/curp/validators.ts:35:44
       return null;
     }
 
-    if (regexOnlyNumber.test(centuryCode)) {
-      return `19${date}`;
-    } else if (regexOnlyLetter.test(centuryCode)) {
+    if (regexOnlyNumber.test(centuryCode)) {} else if (regexOnlyLetter.test(centuryCode)) {
       return `20${date}`;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] StringLiteral
mx-common-validations/src/curp/validators.ts:36:14
     }
 
     if (regexOnlyNumber.test(centuryCode)) {
-      return `19${date}`;
+      return ``;
     } else if (regexOnlyLetter.test(centuryCode)) {
       return `20${date}`;
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Survived] BlockStatement
mx-common-validations/src/curp/validators.ts:37:51
 
     if (regexOnlyNumber.test(centuryCode)) {
       return `19${date}`;
-    } else if (regexOnlyLetter.test(centuryCode)) {
-      return `20${date}`;
-    }
+    } else if (regexOnlyLetter.test(centuryCode)) {}
     return null;
   }

[Survived] ConditionalExpression
mx-common-validations/src/curp/validators.ts:37:16
 
     if (regexOnlyNumber.test(centuryCode)) {
       return `19${date}`;
-    } else if (regexOnlyLetter.test(centuryCode)) {
+    } else if (true) {
       return `20${date}`;
     }

[Survived] ArithmeticOperator
mx-common-validations/src/curp/validators.ts:50:20
     const month = parseInt(date.substring(4, 6));
     const year = parseInt(date.substring(0, 4));
 
-    const isLeap = year % 4 === 0;
+    const isLeap = year * 4 === 0;
 
     if (day < 1 || day > 31) {

[Survived] ConditionalExpression
mx-common-validations/src/curp/validators.ts:50:20
     const month = parseInt(date.substring(4, 6));
     const year = parseInt(date.substring(0, 4));
 
-    const isLeap = year % 4 === 0;
+    const isLeap = true;
 
     if (day < 1 || day > 31) {

[Killed] ConditionalExpression
mx-common-validations/src/curp/validators.ts:52:9
 
     const isLeap = year % 4 === 0;
 
-    if (day < 1 || day > 31) {
+    if (true) {
       return false;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] EqualityOperator
mx-common-validations/src/curp/validators.ts:52:20
 
     const isLeap = year % 4 === 0;
 
-    if (day < 1 || day > 31) {
+    if (day < 1 || day >= 31) {
       return false;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[NoCoverage] BooleanLiteral
mx-common-validations/src/curp/validators.ts:53:14
     const isLeap = year % 4 === 0;
 
     if (day < 1 || day > 31) {
-      return false;
+      return true;
     }
     if (month < 1 || month > 12) {

[Killed] EqualityOperator
mx-common-validations/src/curp/validators.ts:55:9
     if (day < 1 || day > 31) {
       return false;
     }
-    if (month < 1 || month > 12) {
+    if (month >= 1 || month > 12) {
       return false;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] EqualityOperator
mx-common-validations/src/curp/validators.ts:55:22
     if (day < 1 || day > 31) {
       return false;
     }
-    if (month < 1 || month > 12) {
+    if (month < 1 || month >= 12) {
       return false;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[NoCoverage] BooleanLiteral
mx-common-validations/src/curp/validators.ts:56:14
       return false;
     }
     if (month < 1 || month > 12) {
-      return false;
+      return true;
     }
     if (month30Days.indexOf(month) > -1 && day === 31) {

[Killed] EqualityOperator
mx-common-validations/src/curp/validators.ts:58:9
     if (month < 1 || month > 12) {
       return false;
     }
-    if (month30Days.indexOf(month) > -1 && day === 31) {
+    if (month30Days.indexOf(month) <= -1 && day === 31) {
       return false;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] ConditionalExpression
mx-common-validations/src/curp/validators.ts:58:9
     if (month < 1 || month > 12) {
       return false;
     }
-    if (month30Days.indexOf(month) > -1 && day === 31) {
+    if (true) {
       return false;
     }
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Survived] BooleanLiteral
mx-common-validations/src/curp/validators.ts:59:14
       return false;
     }
     if (month30Days.indexOf(month) > -1 && day === 31) {
-      return false;
+      return true;
     }
     if (month === 2) {

[Killed] ConditionalExpression
mx-common-validations/src/curp/validators.ts:61:9
     if (month30Days.indexOf(month) > -1 && day === 31) {
       return false;
     }
-    if (month === 2) {
+    if (true) {
       if (day > 28 && !isLeap) {
         return false;
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] EqualityOperator
mx-common-validations/src/curp/validators.ts:61:9
     if (month30Days.indexOf(month) > -1 && day === 31) {
       return false;
     }
-    if (month === 2) {
+    if (month !== 2) {
       if (day > 28 && !isLeap) {
         return false;
killedBy: CurpValidators #validateFormat should return true for a valid curp format
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Survived] ConditionalExpression
mx-common-validations/src/curp/validators.ts:62:11
       return false;
     }
     if (month === 2) {
-      if (day > 28 && !isLeap) {
+      if (false) {
         return false;
       }

[Survived] EqualityOperator
mx-common-validations/src/curp/validators.ts:62:11
       return false;
     }
     if (month === 2) {
-      if (day > 28 && !isLeap) {
+      if (day >= 28 && !isLeap) {
         return false;
       }

[Survived] BooleanLiteral
mx-common-validations/src/curp/validators.ts:63:16
     }
     if (month === 2) {
       if (day > 28 && !isLeap) {
-        return false;
+        return true;
       }
       if (day > 29 && isLeap) {

[NoCoverage] BlockStatement
mx-common-validations/src/curp/validators.ts:65:31
       if (day > 28 && !isLeap) {
         return false;
       }
-      if (day > 29 && isLeap) {
-        return false;
-      }
+      if (day > 29 && isLeap) {}
     }
     return true;

[Survived] EqualityOperator
mx-common-validations/src/curp/validators.ts:65:11
       if (day > 28 && !isLeap) {
         return false;
       }
-      if (day > 29 && isLeap) {
+      if (day >= 29 && isLeap) {
         return false;
       }

[NoCoverage] BooleanLiteral
mx-common-validations/src/curp/validators.ts:66:16
         return false;
       }
       if (day > 29 && isLeap) {
-        return false;
+        return true;
       }
     }

[Survived] ArithmeticOperator
mx-common-validations/src/curp/validators.ts:79:16
 
     const today = new Date();
     const dd = today.getDate();
-    const mm = today.getMonth() + 1;
+    const mm = today.getMonth() - 1;
     const yyyy = today.getFullYear();
 

[Killed] ArithmeticOperator
mx-common-validations/src/curp/validators.ts:82:21
     const mm = today.getMonth() + 1;
     const yyyy = today.getFullYear();
 
-    const minYear = yyyy - maxAge;
+    const minYear = yyyy + maxAge;
     const maxYear = yyyy - minAge;
 
killedBy: CurpValidators #validateFormatAndAge should return true for a curp with a valid format and age between 18 and 30
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Survived] ArithmeticOperator
mx-common-validations/src/curp/validators.ts:83:21
     const yyyy = today.getFullYear();
 
     const minYear = yyyy - maxAge;
-    const maxYear = yyyy - minAge;
+    const maxYear = yyyy + minAge;
 
     if (year < minYear || year > maxYear) {

[Killed] EqualityOperator
mx-common-validations/src/curp/validators.ts:85:27
     const minYear = yyyy - maxAge;
     const maxYear = yyyy - minAge;
 
-    if (year < minYear || year > maxYear) {
+    if (year < minYear || year <= maxYear) {
       return false;
     }
killedBy: CurpValidators #validateFormatAndAge should return true for a curp with a valid format and age between 18 and 30
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] ConditionalExpression
mx-common-validations/src/curp/validators.ts:85:9
     const minYear = yyyy - maxAge;
     const maxYear = yyyy - minAge;
 
-    if (year < minYear || year > maxYear) {
+    if (true) {
       return false;
     }
killedBy: CurpValidators #validateFormatAndAge should return true for a curp with a valid format and age between 18 and 30
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Survived] BooleanLiteral
mx-common-validations/src/curp/validators.ts:86:14
     const maxYear = yyyy - minAge;
 
     if (year < minYear || year > maxYear) {
-      return false;
+      return true;
     }
     if (year === minYear) {

[Survived] ConditionalExpression
mx-common-validations/src/curp/validators.ts:88:9
     if (year < minYear || year > maxYear) {
       return false;
     }
-    if (year === minYear) {
+    if (true) {
       if (month < mm) {
         return false;

[Survived] EqualityOperator
mx-common-validations/src/curp/validators.ts:88:9
     if (year < minYear || year > maxYear) {
       return false;
     }
-    if (year === minYear) {
+    if (year !== minYear) {
       if (month < mm) {
         return false;

[Survived] ConditionalExpression
mx-common-validations/src/curp/validators.ts:89:11
       return false;
     }
     if (year === minYear) {
-      if (month < mm) {
+      if (false) {
         return false;
       } else if (month === mm && day <= dd) {

[Survived] EqualityOperator
mx-common-validations/src/curp/validators.ts:89:11
       return false;
     }
     if (year === minYear) {
-      if (month < mm) {
+      if (month <= mm) {
         return false;
       } else if (month === mm && day <= dd) {

[Survived] BooleanLiteral
mx-common-validations/src/curp/validators.ts:90:16
     }
     if (year === minYear) {
       if (month < mm) {
-        return false;
+        return true;
       } else if (month === mm && day <= dd) {
         return false;

[Survived] EqualityOperator
mx-common-validations/src/curp/validators.ts:91:34
     if (year === minYear) {
       if (month < mm) {
         return false;
-      } else if (month === mm && day <= dd) {
+      } else if (month === mm && day > dd) {
         return false;
       }

[Survived] BlockStatement
mx-common-validations/src/curp/validators.ts:91:45
     if (year === minYear) {
       if (month < mm) {
         return false;
-      } else if (month === mm && day <= dd) {
-        return false;
-      }
+      } else if (month === mm && day <= dd) {}
     }
     if (year === maxYear) {

[Survived] BooleanLiteral
mx-common-validations/src/curp/validators.ts:92:16
       if (month < mm) {
         return false;
       } else if (month === mm && day <= dd) {
-        return false;
+        return true;
       }
     }

[Killed] ConditionalExpression
mx-common-validations/src/curp/validators.ts:95:9
         return false;
       }
     }
-    if (year === maxYear) {
+    if (true) {
       if (month > mm) {
         return false;
killedBy: CurpValidators #validateFormatAndAge should return true for a curp with a valid format and age between 18 and 30
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Killed] EqualityOperator
mx-common-validations/src/curp/validators.ts:95:9
         return false;
       }
     }
-    if (year === maxYear) {
+    if (year !== maxYear) {
       if (month > mm) {
         return false;
killedBy: CurpValidators #validateFormatAndAge should return true for a curp with a valid format and age between 18 and 30
statusReason: assert.strictEqual(received, expected)

Expected value to strictly be equal to:
  true
Received:
  false

[Survived] ConditionalExpression
mx-common-validations/src/curp/validators.ts:96:11
       }
     }
     if (year === maxYear) {
-      if (month > mm) {
+      if (true) {
         return false;
       } else if (month === mm && day > dd) {

[Survived] ConditionalExpression
mx-common-validations/src/curp/validators.ts:96:11
       }
     }
     if (year === maxYear) {
-      if (month > mm) {
+      if (false) {
         return false;
       } else if (month === mm && day > dd) {

[Survived] BooleanLiteral
mx-common-validations/src/curp/validators.ts:97:16
     }
     if (year === maxYear) {
       if (month > mm) {
-        return false;
+        return true;
       } else if (month === mm && day > dd) {
         return false;

[Survived] EqualityOperator
mx-common-validations/src/curp/validators.ts:98:34
     if (year === maxYear) {
       if (month > mm) {
         return false;
-      } else if (month === mm && day > dd) {
+      } else if (month === mm && day >= dd) {
         return false;
       }

[Survived] EqualityOperator
mx-common-validations/src/curp/validators.ts:98:34
     if (year === maxYear) {
       if (month > mm) {
         return false;
-      } else if (month === mm && day > dd) {
+      } else if (month === mm && day <= dd) {
         return false;
       }

[Survived] BooleanLiteral
mx-common-validations/src/curp/validators.ts:99:16
       if (month > mm) {
         return false;
       } else if (month === mm && day > dd) {
-        return false;
+        return true;
       }
     }
